<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Mendeley and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.Mendeley</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/mendeley</string>
        <key>NAME</key>
        <string>Mendeley Desktop</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
            <key>category</key>
            <string>Reference</string>
            <key>developer</key>
            <string>Elsevier</string>
    		<key>description</key>
    		<string>Mendeley is a free reference manager and academic social network that can help you organize your research, collaborate with others online, and discover the latest research. - http://www.mendeley.com</string>
    		<key>name</key>
    		<string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
# Microsoft Word 2016/2019 Plugin for Mendeley
# Updated December 6, 2018 - Andrew Valentine
# Copy Mendeley plugin to user plugin directory

if [ -e /Applications/Microsoft\ Word.app ]; then
	echo "Microsoft Word found. Proceeding to setup Mendeley plugin if required."
	else echo "Microsoft Word not found. Nothing more to do."
	exit 0
fi

# Get logged in user

loggedInUser=$(/usr/bin/python -c 'from SystemConfiguration import SCDynamicStoreCopyConsoleUser; import sys; username = (SCDynamicStoreCopyConsoleUser(None, None, None) or [None])[0]; username = [username,""][username in [u"loginwindow", None, u""]]; sys.stdout.write(username + "\n");')

# Get Mendeley version

mendeleyVersion=`(/usr/bin/defaults read /Applications/Mendeley\ Desktop.app/Contents/Info.plist CFBundleShortVersionString)`

# Get plugin versions and paths

appPlugin=`(/bin/ls /Applications/Mendeley\ Desktop.app/Contents/Resources/macWordPlugin/word2016/)`
pathToAppPlugin=/Applications/Mendeley\ Desktop.app/Contents/Resources/macWordPlugin/word2016/$appPlugin
targetPlugin=/Users/$loggedInUser/Library/Group\ Containers/UBF8T346G9.Office/User\ Content.localized/Startup.localized/Word/$appPlugin
pathToTargetPluginDirectory=/Users/$loggedInUser/Library/Group\ Containers/UBF8T346G9.Office/User\ Content.localized/Startup.localized/Word/

# If not already present, copy current Mendeley plugin to user plugin directory

if [ ! -e "$targetPlugin" ]; then
	echo "No user plugin for Mendeley version $mendeleyVersion installed. Proceeding to install."
	if [ ! -e "$pathToTargetPluginDirectory" ]; then
		/bin/mkdir -p $pathToTargetPluginDirectory
	fi
	/bin/cp "$pathToAppPlugin" "$pathToTargetPluginDirectory"
	else echo "Plugin does not need updating."
	exit 0
fi</string>
            <key>display_name</key>
            <string>%NAME%</string>
	    <key>postuninstall_script</key>
	    <string>#!/bin/bash

# Get logged in user

loggedInUser=$(/usr/bin/python -c 'from SystemConfiguration import SCDynamicStoreCopyConsoleUser; import sys; username = (SCDynamicStoreCopyConsoleUser(None, None, None) or [None])[0]; username = [username,""][username in [u"loginwindow", None, u""]]; sys.stdout.write(username + "\n");')

# Get plugin directory path

pluginDirectory=/Users/$loggedInUser/Library/Group\ Containers/UBF8T346G9.Office/User\ Content.localized/Startup.localized/Word

# Remove installed Mendeley plugins

/bin/rm "$pluginDirectory"/Mendeley*

exit 0</string>
    	   <key>unattended_install</key>
    	   <true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.Mendeley</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
