<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest verison of Ghostscript</string>
		<key>Identifier</key>
		<string>com.github.joshua-d-miller.download.ghostscript</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Ghostscript</string>
			<key>SEARCH_URL</key>
			<string>https://pages.uoregon.edu/koch/</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%SEARCH_URL%</string>
					<key>result_output_var_name</key>
					<string>version</string>
					<key>re_pattern</key>
					<string>Ghostscript-(?P&lt;url&gt;\d{1,}\.\d{1,}\.{0,}\d{0,}).pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://pages.uoregon.edu/koch/Ghostscript-%version%.pkg</string>
					<key>filename</key>
					<string>%NAME%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Richard Koch (RBGCY5RJWM)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>