<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Stellarium</string>
		<key>ARCHITECTURE</key>
		<string>x64</string>
	</dict>
	<key>Description</key>
	<string>Downloads the latest version of Stellarium. You may choose between x64 and arm64 as architecture; this recipes defaults to x64.</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.autopkg.download.Stellarium</string>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
	<dict>
		<key>Processor</key>
		<string>GitHubReleasesInfoProvider</string>
		<key>Arguments</key>
		<dict>
			<key>github_repo</key>
			<string>Stellarium/Stellarium</string>
            		<key>asset_regex</key>
            		<string>.*%ARCHITECTURE%.zip</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>%url%</string>
			<key>filename</key>
			<string>%NAME%.zip</string>
		</dict>
	</dict>
    <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
            <key>archive_path</key>
            <string>%pathname%</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            <key>purge_destination</key>
            <true/>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
            <key>input_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
            <key>requirement</key>
            <string>identifier "org.stellarium.Stellarium" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3WW8XR23DF"</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>DmgCreator</string>
        <key>Arguments</key>
        <dict>
            <key>dmg_root</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            <key>dmg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
        </dict>
    </dict>
    <dict>
		<key>Processor</key>
		<string>EndOfCheckPhase</string>
	</dict>
	</array>
</dict>
</plist>
