<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Silhouette Studio</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.download.silhouettestudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Silhouette Studio</string>
        <key>url</key>
        <string>https://dl.silhcdn.com/9fe0f01ebb6bd530</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Silhouette Studio.app</string>
                <key>requirement</key>
                <string>identifier "com.silhouettesoftware.Silhouette-Studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = TAX3B9PB9G</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
