<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of DinoXcope and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.dinoxcope</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Science</string>
        <key>NAME</key>
        <string>DinoXcope</string>
    	<key>pkginfo</key>
    	<dict>
    	   <key>catalogs</key>
    	   <array>
    	       <string>testing</string>
    	   </array>
            <key>display_name</key>
            <string>DinoXcope</string>
            <key>category</key>
            <string>Science</string>
            <key>developer</key>
            <string>AnMo Electronics Corporation</string>
    	<key>description</key>
    	<string>This package will install the driver and software needed to use DinoXcope microscopes.  These microscopes are used for industrial inspection, health care, research, documentation, education, and more.</string>
    	<key>name</key>
    	<string>%NAME%</string>
    	<key>unattended_install</key>
    	<true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.download.dinoxcope</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
