<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Evernote</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.download.evernote</string>
    <key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Evernote</string>
		<key>SEARCH_URL</key>
		<string>https://evernote.com/download</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 11_0_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/86.0.4240.193 Safari/537.36 Edg/86.0.622.68</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;https:\/\/cdn1\.evernote\.com\/boron\/mac\/builds\/Evernote-[\d.]+-[\d]+\.dmg)</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        	   <key>url</key>
        	   <string>%url%</string>
        	   <key>filename</key>
        	   <string>%NAME%.dmg</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Evernote.app</string>
                <key>requirement</key>
                <string>identifier "com.evernote.Evernote" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Q79WDW8YH9</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
