<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Josh Jacob's TNEF's Enough</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.tnefenough</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TNEF Enough</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>http://www.joshjacob.com/mac-development/tnef.php</string>
                    <key>re_pattern</key>
                    <string>(?P&lt;file&gt;TNEF*.*\.dmg)</string>
                </dict>
            </dict>
            <dict>
        	   <key>Processor</key>
        	   <string>CURLDownloader</string>
        	   <key>Arguments</key>
        	   <dict>
        	       <key>url</key>
                    <string>http://www.joshjacob.com/mac-development/%file%</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
        	   </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            </array>
</dict>
</plist>
