<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Josh Jacob's TNEF's Enough</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.tnefenough</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TNEF Enough</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>http://www.joshjacob.com/mac-development/tnef.php</string>
                    <key>re_pattern</key>
                    <string>(?P&lt;file&gt;TNEF*.*\.dmg)</string>
                </dict>
            </dict>
            <dict>
        	   <key>Processor</key>
        	   <string>URLDownloader</string>
        	   <key>Arguments</key>
        	   <dict>
        	       <key>url</key>
                    <string>http://www.joshjacob.com/mac-development/%file%</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
        	   </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
    			<dict>
    				<key>input_path</key>
    				<string>%pathname%/TNEF's Enough.app</string>
    				<key>requirement</key>
    				<string>anchor apple generic and identifier "com.joshjacob.TNEFsEnough" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2P5CH9925X")</string>
    			</dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            </array>
</dict>
</plist>
