<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Amazon Music</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.AmazonMusicJDM</string>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
    <key>Input</key>
    <dict>
		<key>DOWNLOAD_URL</key>
		<string>https://qatgqujbd2.execute-api.us-west-2.amazonaws.com/prod/getCurrentVersion</string>
		<key>NAME</key>
		<string>Amazon Music</string>
	</dict>
	<key>Process</key>
	<array>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
