<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Logitech Control Center</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.download.logitechcc</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LogiCntr</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://support.logitech.com/en_us/software/logitech-control-center-for-macintosh-os-x</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://www.logitech.com/pub/techsupport/mouse/mac/lcc.*?\.zip)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/LogiCntr</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/LogiCntr/LCC Installer.app/Contents/Resources/Logitech Control Center.mpkg</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/Logitech Control Center.mpkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/LogiCntr/</string>
                </array>
            </dict>
        </dict>
    <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
    </dict>
    <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
            <key>input_path</key>
            <string>%RECIPE_CACHE_DIR%/Logitech Control Center.mpkg</string>
            <key>expected_authority_names</key>
            <array>
                <string>Developer ID Installer: Logitech Inc.</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
            </array>
        </dict>
    </dict>
  </array>
</dict>
</plist>