<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Inspiration 9 (CD) and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.inspiration9cd</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Media</string>
        <key>NAME</key>
        <string>Inspiration 9</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
            <key>category</key>
            <string>Media</string>
            <key>developer</key>
            <string>Inspiration Software Inc.</string>
            <key>display_name</key>
            <string>Inspiration 9</string>
    		<key>description</key>
    		<string>For visual mapping, outlining, writing and making presentations, use Inspiration 9, the ultimate thinking and learning tool. Brainstorm ideas, structure your thoughts and visually communicate concepts to strengthen understanding with the Diagram and Map Views. To take notes, organize information, and structure writing for plans, papers and reports, use the integrated Outline View to focus on main and supporting ideas and to clarify thinking in written form. With Inspiration's Presentation Manager, transform your diagrams, mind maps and outlines into polished presentations that communicate ideas clearly and demonstrate understanding and knowledge.</string>
    		<key>name</key>
    		<string>%NAME%</string>
    		<key>unattended_install</key>
    		<true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.download.inspiration9cd</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>