<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of DYMO Label Software</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.dymolabel</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Dymo Label</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.dymo.com/en-US/online-support/dymo-user-guides</string>
                <key>re_pattern</key>
                <string>http://download.dymo.com/dymo/Software/Mac/DL.*?Setup\.(?P&lt;build&gt;.*?)\.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.dymo.com/en-US/online-support/dymo-user-guides</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://download.dymo.com/dymo/Software/Mac/DLS.*?Setup\..*?\.dmg)</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>