<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest release version of Oracle Java 10 JDK and imports into Munki. (Reference https://github.com/autopkg/nmcspadden-recipes/blob/master/Oracle/OracleJava8JDK.munki.recipe)</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.OpenJDK11.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenJDK11</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Oracle/Java/JDK/11</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Utility</string>
            <key>developer</key>
            <string>Oracle</string>
            <key>description</key>
            <string>The JDK is a development environment for building applications, applets, and components using the Java programming language. The JDK includes tools useful for developing and testing programs written in the Java programming language and running on the Java platform.</string>
            <key>display_name</key>
            <string>Open Java 11 Development Kit</string>
        	<key>minimum_os_version</key>
        	<string>10.7.5</string>
            <key>name</key>
            <string>Open JDK</string>
            <key>preinstall_script</key>
            <string>#!/bin/bash
        # Remove all Previous Versions of JDK
        /bin/rm -rf /Library/Java/JavaVirtualMachines/jdk*
        exit 0
            </string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>supported_architectures</key>
            <array>
               <string>i386</string>
               <string>x86_64</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.OpenJDK11</string>
<!-- Process Borrowed from rtrouton's PKG Recipe and added InstallsCreator -->
    <key>Process</key>
    <array>
    <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
           <key>pkgroot</key>
           <string>%RECIPE_CACHE_DIR%/pkgroot</string>
           <key>pkgdirs</key>
           <dict>
              <key>Library</key>
              <string>0755</string>
              <key>Library/Java</key>
              <string>0755</string>
              <key>Library/Java/JavaVirtualMachines</key>
              <string>0755</string>
           </dict>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
           <key>archive_path</key>
           <string>%pathname%</string>
           <key>destination_path</key>
           <string>%pkgroot%/Library/Java/JavaVirtualMachines</string>
           <key>purge_destination</key>
           <true />
        </dict>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
           <key>pattern</key>
           <string>%pkgroot%/Library/Java/JavaVirtualMachines/jdk*/Contents/Info.plist</string>
        </dict>
        <key>Processor</key>
        <string>FileFinder</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
           <key>input_plist_path</key>
           <string>%found_filename%</string>
           <key>plist_version_key</key>
           <string>CFBundleVersion</string>
        </dict>
        <key>Processor</key>
        <string>Versioner</string>
    </dict>
    <dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
        <key>Arguments</key>
        <dict>
            <key>faux_root</key>
            <string>%pkgroot%</string>
            <key>installs_item_paths</key>
            <array>
                <string>/Library/Java/JavaVirtualMachines/jdk-%version%.jdk</string>
            </array>
            <key>version_comparison_key</key>
            <string>CFBundleVersion</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
           <key>pkg_request</key>
           <dict>
              <key>pkgname</key>
              <string>%VENDOR%-%version%</string>
              <key>version</key>
              <string>%version%</string>
              <key>id</key>
              <string>net.java.openjdk</string>
              <key>scripts</key>
              <string>Scripts</string>
              <key>options</key>
              <string>purge_ds_store</string>
              <key>chown</key>
              <array>
                 <dict>
                    <key>path</key>
                    <string>Library</string>
                    <key>user</key>
                    <string>root</string>
                    <key>group</key>
                    <string>wheel</string>
                 </dict>
                 <dict>
                    <key>path</key>
                    <string>Library/Java</string>
                    <key>user</key>
                    <string>root</string>
                    <key>group</key>
                    <string>wheel</string>
                 </dict>
                 <dict>
                    <key>path</key>
                    <string>Library/Java/JavaVirtualMachines</string>
                    <key>user</key>
                    <string>root</string>
                    <key>group</key>
                    <string>wheel</string>
                 </dict>
              </array>
           </dict>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>PathDeleter</string>
        <key>Arguments</key>
        <dict>
           <key>path_list</key>
           <array>
              <string>%RECIPE_CACHE_DIR%/pkgroot</string>
           </array>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
        <key>Arguments</key>
        <dict/>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%VENDOR%-%version%.pkg</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
            <key>additional_makepkginfo_options</key>
            <array>
                <string>--pkgvers=%version%</string>
            </array>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
    </dict>
    </array>
</dict>
</plist>
