<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Box and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.Box</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/box</string>
        <key>NAME</key>
        <string>Box</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
			<array>
				<string>Box</string>
			</array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>display_name</key>
            <string>Box</string>
            <key>category</key>
            <string>Social</string>
            <key>developer</key>
            <string>Box</string>
            <key>description</key>
            <string>Box Drive is natively integrated into Windows Explorer and Mac Finder so it's built right into the way you already work.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.download.Box</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_ids_set_optional_true</key>
                <array>
                    <string>com.box.desktop.installer.osxfuse</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>MunkiOptionalReceiptEditor</string>
        </dict>
    </array>
</dict>
</plist>
