<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Box</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.Box</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Box</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>https://e3.boxcdn.net/box-installers/desktop/releases/mac/Box.pkg</string>
        		<key>filename</key>
        		<string>%NAME%.pkg</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Box, Inc. (M683GB7CPW)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
