<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Box Notes and imports it into Munki. This borrows code from rustymyers' recipe as his deletes it upon verification.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.boxnotes</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/box</string>
        <key>NAME</key>
        <string>Box Notes</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>Social</string>
            <key>developer</key>
            <string>Box</string>
            <key>description</key>
            <string>Box Notes makes it easy to create meeting notes, share ideas, track status updates and plan projects together — there's no limit to your productivity. And, every Box Note is instantly available on web, mobile or your desktop, so you can access your ideas from anywhere.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://e3.boxcdn.net/box-installers/boxnotes/mac/latest/Box%20Notes.zip</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/Box Notes.app</string>
                <key>requirement</key>
                <string>identifier "com.box.box-notes" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = M683GB7CPW</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
        		<key>dmg_root</key>
        		<string>%RECIPE_CACHE_DIR%/Box Notes.app</string>
        		<key>dmg_path</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
        	</dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
