<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Techsmith Capture and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.techsmithcapture</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/techsmithcapture</string>
        <key>NAME</key>
        <string>Techsmith Capture</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
            <key>category</key>
            <string>Multimedia</string>
            <key>developer</key>
            <string>Techsmith</string>
    		<key>description</key>
    		<string>Whether for work, home, or play, TechSmith Capture provides a simple, free way to create basic screenshots and screen recordings and share them with others.</string>
    		<key>name</key>
    		<string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/sh
# Remove Jing as Techsmith Capture is the updated version of Jing
if [[ -d /Applications/Jing.app ]]
then
    /bin/rm -rf /Applications/Jing.app
fi
            </string>
            <key>display_name</key>
            <string>%NAME%</string>
    		<key>unattended_install</key>
    		<true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.download.techsmithcapture</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
