<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Techsmith Capture</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.techsmithcapture</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Techsmith Capture</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>https://assets.techsmith.com/techsmithcapture/mac/TechSmithCapture.dmg</string>
        		<key>filename</key>
        		<string>%NAME%.dmg</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.techsmith.relayrecorder" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7TQL462TU8"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
