<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of LyX</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.LyX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LyX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.lyx.org/Download</string>
                <key>re_pattern</key>
				<string>bin\/(?P&lt;versiondir&gt;.*?)\/(?P&lt;file&gt;LyX-.*?\+qt.*?-x86_64-arm64-cocoa\.dmg)</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
						<string>https://ftp.lip6.fr/pub/lyx/bin/%versiondir%/%file%</string>
        		<key>filename</key>
        		<string>%NAME%.dmg</string>
        	</dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/LyX.app</string>
                <key>requirement</key>
                <string>identifier "org.lyx.lyx" and certificate leaf = H"bc48ff7941c33f70838298a129f92745a39e654b"</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
