<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of LyX</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.LyX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LyX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.lyx.org/Download</string>
                <key>re_pattern</key>
                <string>ftp://ftp\.lyx\.org/pub/lyx/bin/.*?/LyX-(?P&lt;version&gt;.*?)\+qt.*?-x86_64-cocoa\.dmg</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>CURLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>https://ftp.icm.edu.pl/packages/lyx/bin/%version%/LyX-%version%+qt5-x86_x64-cocoa.dmg</string>
        		<key>filename</key>
        		<string>%NAME%.dmg</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
