<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of tn3270 X and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.tn3270X</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Administrative</string>
        <key>NAME</key>
        <string>tn3270X</string>
        <key>base_url</key>
        <string>http://www.brown.edu/cis/tn3270/</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
    		<key>description</key>
    		<string>Brown TN3720 is designed for Macintosh users who have an account on a remote host that requires 3270 terminal emulation. Typically at Penn State, TN3720 is used to connect to the IBM mainframe maintained by AIS. Generally, it is used to connect to a VM- or MVS-based host from a Macintosh, providing the capability to login to a remote host, so that the Mac can function as a terminal connected to that host. Note that in most cases, users will need an account in order to connect to a machine. To connect to a UNIX system or computers, users can use SSH or an SSH-based client rather than TN3270. - http://ais.its.psu.edu/support/mainframe_mac.asp</string>
    		<key>name</key>
    		<string>%NAME%</string>
    		<key>unattended_install</key>
    		<true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.tn3270X</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
