<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Unity 3D</string>
        <key>ARCH</key>
        <string></string>
        <key>RELEASE_YEAR</key>
        <string>2023</string>
    </dict>
    <key>Description</key>
    <string>Downloads the latest version of Unity 3D Editor for Macs.

Possible values for "ARCH":
- Leave blank for "Intel" (Default)
- "Arm64" for Apple Silicon</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.download.Unity3D</string>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
    <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>https://unity.com/releases/editor/archive</string>
            <key>curl_opts</key>
            <array>
                <string>-L</string>
            </array>
            <key>re_pattern</key>
            <string>href=\"unityhub://%RELEASE_YEAR%\.[0-9]+\.[0-9]+f[0-9]+/([A-Za-z0-9]+)\"</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>https://download.unity3d.com/download_unity/%match%/MacEditorInstaller%ARCH%/Unity.pkg</string>
            <key>filename</key>
            <string>%NAME%.pkg</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
        <key>Arguments</key>
        <dict>
            <key>expected_authority_names</key>
            <array>
                <string>Developer ID Installer: Unity Technologies ApS (BVPN9UFA9B)</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
            </array>
            <key>input_path</key>
            <string>%pathname%</string>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
    </dict>
    </array>
</dict>
</plist>
