<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Unity 3D</string>
	</dict>
	<key>Description</key>
	<string>Downloads the latest version of Unity 3D Editor.</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.autopkg.download.Unity3D</string>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
    <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
            <key>url</key>
            <string>https://unity3d.com/unity/whats-new</string>
            <key>re_pattern</key>
            <string>(?P&lt;url&gt;https:\/\/download\.unity3d\.com\/download_unity\/.*\/MacEditorInstaller\/Unity\.pkg)</string>
        </dict>
    </dict>
	<dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>%url%</string>
			<key>filename</key>
			<string>%NAME%.pkg</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>EndOfCheckPhase</string>
	</dict>
	</array>
</dict>
</plist>
