<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Audacity</string>
	</dict>
	<key>Description</key>
	<string>Downloads the latest version of Audacity.</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.autopkg.download.audacity</string>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
	<dict>
		<key>Processor</key>
		<string>GitHubReleasesInfoProvider</string>
		<key>Arguments</key>
		<dict>
			<key>github_repo</key>
			<string>audacity/audacity</string>
			<key>asset_regex</key>
			<string>audacity-macos-[\d]\.[\d]\.[\d]\-Intel\.dmg</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>%url%</string>
			<key>filename</key>
			<string>%NAME%.dmg</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>CodeSignatureVerifier</string>
		<key>Arguments</key>
		<dict>
			<key>input_path</key>
			<string>%pathname%/%NAME%.app</string>
			<key>requirement</key>
			<string>identifier "org.audacityteam.audacity" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = T3N4JQ7YY6</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>EndOfCheckPhase</string>
	</dict>
	</array>
</dict>
</plist>
