<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest verison of Kaltura Capture</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.download.kalturacapture</string>
    <key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kaltura Capture</string>
		<key>SEARCH_URL</key>
		<string>https://knowledge.kaltura.com/help/kaltura-capture-release-notes</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.214 Safari/537.36</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>result_output_var_name</key>
                <string>download_url</string>
                <key>re_pattern</key>
                <string>(https:\/\/cdnapisec.kaltura.com\/content\/static\/classroom\/v([\d]\.[\d]\.[\d.]+)\/KalturaCapture_([\d]\.[\d]\.[\d.]+).dmg)</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        	   <key>url</key>
               <string>%download_url%</string>
        	   <key>filename</key>
        	   <string>%NAME%.dmg</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/KalturaCapture.app</string>
                <key>requirement</key>
                <string>identifier "com.electron.kalturacapture" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = X8RDCFJK95</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
