<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of OBS Studio and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.autopkg.munki.OBS</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/obs</string>
		<key>NAME</key>
		<string>Open Broadcaster Software</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Free and open source software for video recording and live streaming. Download and start streaming quickly and easily on Windows, Mac or Linux.</string>
			<key>developer</key>
			<string>Hugh Bailey</string>
			<key>display_name</key>
			<string>Open Broadcaster Software</string>
			<key>name</key>
			<string>%NAME%</string>
            <key>category</key>
            <string>Multimedia</string>
			<key>unattended_install</key>
			<true/>
			<key>postinstall_script</key>
			<string>#!/bin/sh
# copy virtual camera plug-in to its needed location to avoid an admin
# credentials prompt when starting the virtual camera for the first time
/bin/cp -R /Applications/OBS.app/Contents/Resources/data/obs-plugins/mac-virtualcam/obs-mac-virtualcam.plugin /Library/CoreMediaIO/Plug-Ins/DAL/
			</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh
# remove virtual camera plug-in
/bin/rm -r /Library/CoreMediaIO/Plug-Ins/DAL/obs-mac-virtualcam.plugin
		</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nstrauss.download.OBS</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
