<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Dropbox Capture and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.DropboxCapture</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/dropboxcapture</string>
        <key>NAME</key>
        <string>Dropbox Capture</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
    	    </array>
        <key>category</key>
        <string>Productivity</string>
        <key>developer</key>
        <string>Dropbox</string>
    	<key>description</key>
    	<string>Try Dropbox Capture, and get your message across with screenshots, GIFs, or simple videos recorded right on your screen. So you can clearly say what you mean without scheduling anything.</string>
    	<key>name</key>
    	<string>%NAME%</string>
        <key>display_name</key>
        <string>%NAME%</string>
    	<key>unattended_install</key>
    	<true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.download.DropboxCapture</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
