<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Sketchpad BETA Universal</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.sketchpadbeta</string>
	<key>MinimumVersion</key>
	<string>0.3.0</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Sketchpad - BETA</string>
		<key>SEARCH_URL</key>
		<string>https://gsptest.scratchconsortium.com/download.html</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;https:\/\/gsptest\.scratchconsortium\.com\/downloads\/GSP_\d{4,}\.zip)</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        	   <key>url</key>
        	   <string>%url%</string>
        	   <key>filename</key>
        	   <string>%NAME%.zip</string>
        	</dict>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>Unarchiver</string>
        	<key>Arguments</key>
        	<dict>
        		<key>purge_destination</key>
        		<true/>
        	</dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Sketchpad BETA *.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.kcptech.Sketchpad" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S4CY52J26G)</string>
            </dict>
        </dict>
		<dict>
        	<key>Processor</key>
        	<string>DmgCreator</string>
        	<key>Arguments</key>
        	<dict>
        		<key>dmg_root</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
        		<key>dmg_path</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>dmg_megabytes</key>
                <string>500</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
