<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Studiocode 10 and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.joshua-d-miller.autopkg.munki.StudioCode10</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>Media</string>
        <key>NAME</key>
        <string>Studiocode 10</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
            <key>category</key>
            <string>Media</string>
            <key>developer</key>
            <string>Studiocode Business Group</string>
    		<key>description</key>
    		<string>(LICENSE REQUIRED)

Capture

Studiocode makes capturing video footage a breeze! Whether it’s on your video camera, a Hard drive, DVD or even on a VHS tape, Studiocode makes it simple for you to capture directly onto your computer.

Categorize

Studiocode delivers powerful and precise coding tools that work for virtually any discipline, project or individual. With an open coding template coupled with transcription options, Studiocode gives you more creative and content control choices than you ever thought possible.

Analyze

Studiocode is leading the world in intelligent analysis linked to video. The search operative functionality and features jammed into this product make it the most impressive analysis tool for video on the earth.

Distribute

Seamlessly publish and distribute your valuable video assets across your campus, organization, community or even the globe. Accessing your video assets has never been as simple, secure or powerful.

www.studiocodegroup.com</string>
    		<key>name</key>
    		<string>%NAME%</string>
    		<key>unattended_install</key>
            <true/>
            <key>display_name</key>
            <string>%NAME%</string>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.autopkg.download.Studiocode10</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
