<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Gephi</string>
	</dict>
	<key>Description</key>
	<string>Downloads the latest version of ShiftIt.</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.autopkg.download.ShiftIt</string>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
	<dict>
		<key>Processor</key>
		<string>GitHubReleasesInfoProvider</string>
		<key>Arguments</key>
		<dict>
			<key>github_repo</key>
			<string>fikovnik/ShiftIt</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>%url%</string>
			<key>filename</key>
			<string>%NAME%.zip</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>EndOfCheckPhase</string>
	</dict>
	</array>
</dict>
</plist>
