<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Fathom.</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.fathom</string>
	<key>Input</key>
	<dict>
        <key>DOWNLOAD_URL</key>
        <string>https://fathom.concord.org/wp-content/uploads/software/fathom-installers.zip</string>
		<key>NAME</key>
		<string>Fathom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>%DOWNLOAD_URL%</string>
        		<key>filename</key>
        		<string>%NAME%.zip</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/fathom-installers/*.dmg</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg/Fathom */Fathom.app</string>
                <key>requirement</key>
                <string>identifier "org.concord.fathom" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = T8HS8WBPPQ</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg/Fathom */Fathom.app/Contents/Info.plist</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg/%dmg_found_filename%</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleVersion</key>
                    <string>version</string>
                    <key>CFBundleShortVersionString</key>
                    <string>fathom_dir</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>             
	</array>
</dict>
</plist>