<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Fathom</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.fathom</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fathom</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://http://concord.org/fathom-dynamic-data-software</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://concord\.org/sites/default/files/downloads/software/fathom/Fathom.*?\.dmg)</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>http://%url%</string>
        		<key>filename</key>
        		<string>%NAME%.dmg</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>