<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of GeoGebra</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.geogebra</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GeoGebra</string>
		<key>DOWNLOAD_URL</key>
		<string>http://www.geogebra.org/download/?os=mac</string>
		<key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
        	<key>Processor</key>
        	<string>Unarchiver</string>
        	<key>Arguments</key>
        	<dict>
        		<key>purge_destination</key>
        		<true/>
        	</dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>DmgCreator</string>
        	<key>Arguments</key>
        	<dict>
        		<key>dmg_root</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
        		<key>dmg_path</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>dmg_megabytes</key>
                <string>200</string>
        	</dict>
        </dict>
	</array>
</dict>
</plist>