<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of the Solstice Client for macOS</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.solsticeclient</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Solstice Client</string>
		<key>SEARCH_URL</key>
		<string>https://www.mersive.com/download</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;https:\/\/www\.mersive\.com\/downloads\/SolsticeClient-[\d.]+\.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/SolsticeClient.app</string>
                <key>requirement</key>
                <string>identifier "com.mersive.solstice.client" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "63B5A5WDNG"</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
