<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Vivaldi</string>
	<key>Identifier</key>
	<string>com.github.joshua-d-miller.download.vivaldi</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cryptomator</string>
		<key>SEARCH_URL</key>
		<string>https://vivaldi.com/download/</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;https:\/\/downloads\.vivaldi\.com\/stable\/Vivaldi\.[\d]\.[\d]\.\d{4,}\.\d{2,}\.universal\.dmg)</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        	   <key>url</key>
        	   <string>%url%</string>
        	   <key>filename</key>
        	   <string>%NAME%.dmg</string>
        	</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Vivaldi.app</string>
                <key>requirement</key>
                <string>identifier "com.vivaldi.Vivaldi" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4XF3XNRN6Y"</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
